In [2]:
import pandas as pd 
import sqlite3 as sql

In [3]:
# Create a connection to the SQLite database
conn = sql.connect('db.sqlite3')
#lets create a cursor object
cur = conn.cursor()

In [32]:
cur.execute("Select name from sqlite_master where type='table';")
cur.fetchall()

[('django_migrations',),
 ('sqlite_sequence',),
 ('Library_members',),
 ('auth_group_permissions',),
 ('auth_user_groups',),
 ('auth_user_user_permissions',),
 ('django_admin_log',),
 ('django_content_type',),
 ('auth_permission',),
 ('auth_group',),
 ('auth_user',),
 ('django_session',),
 ('Library_book',),
 ('Library_favorite',),
 ('Library_borrowedbooks',)]

In [18]:
df= pd.read_sql_query("SELECT * FROM Library_favorite", conn)

In [27]:
df= pd.read_sql_query("SELECT * FROM Library_favorite", conn)
df

   id              email book_id
0  20  Youssef@gmail.com   bgjbn
1  21  Youssef@gmail.com    7777
2  23     test@gmail.com   bgjbn
3  24     test@gmail.com    7777

In [26]:
df= pd.read_sql_query("SELECT * FROM Library_borrowedbooks", conn)
df

   id              email  book_id borrow_date return_date
0   5  Youssef@gmail.com  fgvrthr  2025-05-18  2025-05-25
1   6     test@gmail.com     7777  2025-05-18  2025-05-25

In [33]:
df= pd.read_sql_query("SELECT * FROM Library_book", conn)
df

,id,book_id,name,author,category,description,availability,trending,cover
0,3,4555,sjnjn,ssliil,Science,vcccccc,Not Available,No,book_covers/One_Hundred_Years_of_Solitude.jpg
1,4,7777,One Hundred Years of Solitude,ssliil,History,dmcdkcm,Available,Yes,book_covers/like.png
2,7,B001,Rich Dad Poor Daddd,ssliil,Science,jbbjhbjchd,Available,No,book_covers/Anna_Karenina.jpg
3,8,bgjbn,sd cdv,vbghb,Science,bgjbnjgf,Not Available,Yes,book_covers/One_Hundred_Years_of_Solitude_d3HU...
4,9,cccc,The Great Gatsby,djnvfjgj,Science,vbfjhgbv,Available,Yes,book_covers/Robert_Kiyosaki.jpg
5,10,dbhj,v bhvbgb,vfbhmjgb,History,efjbsrjf,Available,Yes,book_covers/Robert_Kiyosaki_9zsqB2B.jpg
6,11,fgvrthr,hrthgdgf,rhdfghfg,Non-Fiction,hfghthhg,Available,No,book_covers/Screenshot_2024-10-18_004704.png

In [34]:
df= pd.read_sql_query("SELECT * FROM Library_members", conn)
df

   id   username  password                email userType
0   1     Samaaa  12345678    example@gmail.com     User
1   2     Samaaa  12345678  example11@gmail.com    Admin
2   3  Aldwaltly  12345678    Youssef@gmail.com    Admin
3   4    dwaltly  12345678       test@gmail.com     User